<template>
    <div class="regagree">
        <section>
            <p>
                本协议是您与我们就生活缴费服务的使用等相关事项
                所订立的有效合约。请您仔细阅读本协议，如果您对本
                协议的条款有疑问，请通过我们客服渠道进行询问，我们
                将向您解释条款内容。如果您不同意本协议的任意内容，
                或者无法准确理解我们对条款的解释，请不要进行后续操
                作。您通过我们相关页面点击确认或以其他方式选择接
                受本协议，即表示您同意接受本协议的全部内容。
            </p>

            <h5 style="font-size: 0.3rem; margin: 0.2rem 0">
                一、您的权利与义务
            </h5>

            <p>
                1、您自愿申请使用我们生活缴费服务（以下简称“本服 务”）。
                ，对本服务如有疑问、建议或意见时，可拨打我们
                客服电话进行咨询和投诉。
            </p>
            <p>
                2、使用本服务时，请您按照具体页面提示提供必要
                的缴费信息（如：缴费单位、缴费广号），我们将根据您
                提供的缴费信息，向相应的电费缴费机构（以下简称“缴
                费机构”）查询对应的户名、户号地址、可用余额、欠费
                金额、缴费期限等账单信息，以便您确认并准确缴费。同
                时，为便于您后续使用缴费机构提供的配套服务（如：开 具电子发票）
                或帮助您解决潜在纠纷，我们需要将您的
                用户编号提供给相应的缴费机构。部分缴费机构支持缴费
                户号自动查询功能，您可以选择授权我们向前述机构提供
                您的身份信息，用于自动查询并向您展示您名下关联的缴
                费户号及对应的户名、户号地址，以便您进行确认及选 择
            </p>
            <p>
                3、为了您了解账单信息，及时查收缴费通知，我们
                将按照您设置的账单信息向相应的缴费机构查询您的账单
                信息并向您的账户推送账单提醒及欠费提醒服务，具体服
                务内容以我们页面告知的内容为准
            </p>
            <p>
                4、 如果您是通过我们在其他APP开设的店铺或相关
                页面使用本服务，则您可能需要向其他APP运营方提供您
                的缴费信息。我们将根据其他APP运营方同步的缴费信息
                向相应的缴费机构查询您的账单信息，井向其他APP运营
                方同步您的账单信息，以便您能够在其他APP当中及时查
                看并支付您的缴费账单。为了提升您的用户体验，当您将
                您的账户与其他APP账号完成绑定的情况下，您可以选择
                授权其他APP运营方向我们查询并同步您在使用本服务过
                程中曾经留存的缴费信息，以免您手动输入相关信息
            </p>
            <p>
                5、因缴费机构合并、分立、解散、业务调整等原 因，
                可能导致您的缴费户号自动变更或失效，请您关注缴
                费机构及我们的相关公告，若因缴费机构方面原因导致的
                缴费户号自动变更、本服务终止等情况，造成您末能及
                时、准确缴费并由此产生损失，需要您致电缴费机构官方
                热线咨询解决，我们将尽力提供协助。
            </p>
            <p>
                6、我们重视对您的信息保护，遵循合法、正当、必
                要的原则，依照法律法规与《隐私权政策》的规定，严格
                保护您的信息。请您仔细阅读该政策，如有任何疑问，请 随时联系我们
            </p>
            <p>
                7、您使用本服务时实施的所有行为应当遵守国家法
                律、法规和社会公共利益或公共道德，以及遵守银行的相 关业务规则。
            </p>
            <p>
                8、您应当通过客户端、合作银行网站或我们告知的
                特定方式使用本服务。
            </p>
            <p>9、请您确保：</p>
            <p>
                (1） 使用本服务过程中提供的资料真实、准确、完整
                有效。我们按照您提供的相关信息为您提供相应服务，我
                们善意地提示您，如您提供不真实、不准确、不完整或已
                经失效的信息，您需要承担相应损失或责任；
            </p>
            <p>
                (2） 正确填写账单信息，并且妥善保管预留信息，除使
                用本服务外，不要向任何其他人、其他网站、电话或短信
                的问询提供预留的信息内容。如您对账单信息内容有疑问
                的，您可自行联系相应的缴费机构。您理解并同意，您使
                用本协议约定服务，且通过系统发送的指令无法变更或撤
                销，不论本协议是否终止，基于您发出的指令而产生的款
                项和费用无法退回；
            </p>
            <p>
                （3） 我们善意地提示您，使用本服务过程中使用的银行
                卡应当为您本人所有或者已经得到持卡人有效授权，否则
                您需要承担相应的损失或责任。经您点击确认后，相关支
                付指令无法变更或撤销。
            </p>

            <h5 style="font-size: 0.3rem; margin: 0.2rem 0">
                二、我们的权利与义务
            </h5>
            <p>
                1、我们有权根据自身业务的发展，增加、减少或撤
                销缴费服务项目，调整缴费服务的内容，并且有权对本服
                务进行升级、改造。我们善意地提示您，因您通过本服务
                申请缴费的账单迎期或您我们账户资金不足等任何原因导
                致账单支付不成功的，我们将向您返回失败信息，因此导
                致您逾期时间增长或产生其他损失的，您需要承担相应的
                损失或责任，因我们故意或重大过失原因导致的除外
            </p>
            <p>
                2、我们应当在技术上确保整个网络交易平台的安
                全、有效、正常运行，保证您能够顺利使用本协议约定服
                务，并向您提供交易记录、交易资金状态、账户状态等查
                询的服务。但不承担因通讯、停电故障、黑客攻击、银
                行问题、相关机构单位出账问题、不可抗力等非我们原因
                所引起交易中断、交易错误引起的责任。
            </p>
            <p>
                3、我们承诺不会以任何形式挪用您使用本服务的资 金金。
                、本服务目前处于免费期。免费期届满时，我们将
                通过公告的方式提前予以公布，收费调整将在公告届满
                30日起生效。您有权停止使用相关服务；双方协商一致
                的，也可另行变更相关服务和对应协议内容。
            </p>
            <h5 style="font-size: 0.3rem; margin: 0.2rem 0">三、差错处理</h5>
            <p>
                由于您未按规定操作，或者悠白身其他原因造成缴费指令
                未执行、未适当执行、延迟执行的，应及时通过拨打客服 电话
                或通过在线客服通知我们。我们应积极调查并告知 您调查结果。
            </p>

            <h5 style="font-size: 0.3rem; margin: 0.2rem 0">
                四、协议的中止和终止
            </h5>

            <p>
                我们将全力保障您的权益，并不断努力为您提供更好的服
                务。请您理解，在下列情况下，我们可以暂停、中止或终
                止向您提供服务：
            </p>
            <p>1、基于法律法规及政策的规定、监管机构要求或风 险管控的需要；</p>
            <p>2、您违反法律法规或本协议约定内容；</p>
            <p>
                3、将本服务用于非法目的或利用本服务从事侵害他 人合法权益的行为；
            </p>
            <p>4、您的我们账户已注销或被采取限制措施；</p>
            <p>5、我们已提前以公告或其他提示方式通知停止提供 服务的。</p>

            <h5 style="font-size: 0.3rem; margin: 0.2rem 0">五、违约责任</h5>

            <p>
                本协议任何一方违反本协议规定的内容，给另一方造成损
                害的，应当承担违约责任，赔偿另一方因此而造成的直接 损失
            </p>

            <h5 style="font-size: 0.3rem; margin: 0.2rem 0">六、管辖及其他</h5>
            <p>
                1、本协议适用中华人民共和国法律 （仅为本协议之目
                的，为避免歧义，不包括香港特别行政区、澳门特别行政
                区和台湾地区法律）。就本协议的确认、履行或解释发生
                争议，我们与您应努力友好协商解决。如协商不成，双方
                同意由被告所在地法院管辖审理双方的纠纷或争议。
            </p>
            <p>
                2 您理解并同意：若本协议中的某一部分条款或描
                述被相关司法机关判定为无效，该判定无效并不影响其他
                部分的有效性，您仍需依照本协议中的其他部分条款履行
                相关义务同时行使相关权利。
            </p>
            <p>
                3、为了进一步改善用户体验，我们将会持续更新服
                务，为用户提供版本升级、功能升级、规则升级等服务和
                内容的更新，本协议也可能会随之更新。我们会以公告
                客户端通知、短信或弹窗等方式（统称“通知”）就协议
                的更新向您进行告知，更新内容将在前述通知指定日期开
                始生效。若您不同意更新后的条款内容，您有权停止使用
                相关服务；双方协商一致的，也可另行变更相关服务和对 应条款内容。
            </p>
        </section>
    </div>
</template>

<script>
export default {
    name: "lifeagree",
    data() {
        return {
            Data: {},
        };
    },
    mounted() {},
};
</script>

<style lang="less">
.regagree {
    padding: 0.3rem 0.3rem;
    p {
        text-indent: 2em;
    }
    .header {
        font-size: 0.48rem;
        color: #383838;
        font-weight: bold;
        text-align: center;
        height: 1.1rem;
        line-height: 1.1rem;
    }
    .agreeCon {
        h5 {
            font-weight: bold;
            font-size: 0.28rem;
            padding-left: 0.4rem;
            height: 0.56rem;
            line-height: 0.56rem;
        }
        p {
            text-indent: 0.4rem;
            line-height: 0.4rem;
            font-size: 0.24rem;
            color: #666;
        }
    }
}
</style>
